﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
// 
//**********************************************************************
//<AMI_FHDR_START>
//
// Name: NetworkStackSetupScreen.UNI
//
// Description: String definitions for network Template
//
//<AMI_FHDR_END>
//**********************************************************************

/=#
#langdef   en-US   "English"    // English
#langdef   x-AMI "x-AMI"      // AMI Configuration Language

#string STR_NETWORK_STACK_ENABLE        #language en-US   "Network Stack"
                                        #language x-AMI "NWSK000"
#string STR_NETWORK_STACK_HELP          #language en-US   "Enable/Disable UEFI Network Stack"
#string STR_STACK_FORM                  #language en-US   "Network Stack Configuration"
#string STR_STACK_FORM_HELP             #language en-US   "Network Stack Settings"
#string STR_IPV4_PXE_ENABLE             #language en-US   "Ipv4 PXE Support"
                                        #language x-AMI "NWSK001"
#string STR_IPV4_PXE_HELP               #language en-US   "Enable/Disable IPv4 PXE boot support. If disabled, IPv4 PXE boot support will not be available."
#string STR_IPV6_PXE_ENABLE             #language en-US   "Ipv6 PXE Support"
                                        #language x-AMI "NWSK002"
#string STR_IPV6_PXE_HELP               #language en-US   "Enable/Disable IPv6 PXE boot support. If disabled, IPv6 PXE boot support will not be available."

#string STR_IPSEC_CERTIFICATE_ENABLE    #language en-US   "IPSEC Certificate"
                                        #language x-AMI "NWSK003"
#string STR_IPSEC_CERTIFICATE_HELP      #language en-US   "Support to Enable/Disable IPSEC certificate for Ikev."

#string STR_PXE_BOOT_WAIT_TIME          #language en-US   "PXE boot wait time"
                                        #language x-AMI "NWSK004"
#string STR_PXE_BOOT_WAIT_TIME_HELP     #language en-US   "Wait time in seconds to press ESC key to abort the PXE boot. Use either +/- or numeric keys to set the value."

#string STR_MEDIA_DETECT_COUNT             #language en-US   "Media detect count"
                                           #language x-AMI "NWSK005"
#string STR_MEDIA_DETECT_COUNT_HELP        #language en-US  "Number of times the presence of media will be checked. Use either +/- or numeric keys to set the value."

#string STR_IPV4_HTTP_ENABLE            #language en-US   "Ipv4 HTTP Support"
                                        #language x-AMI "NWSK006"
#string STR_IPV4_HTTP_HELP              #language en-US   "Enable/Disable IPv4 HTTP boot support. If disabled, IPv4 HTTP boot support will not be available."
                                                        
#string STR_IPV6_HTTP_ENABLE            #language en-US   "Ipv6 HTTP Support"
                                        #language x-AMI "NWSK007"
#string STR_IPV6_HTTP_HELP              #language en-US   "Enable/Disable IPv6 HTTP boot support. If disabled, IPv6 HTTP boot support will not be available."

#string STR_ENABLED                     #language en-US "Enabled"
#string STR_DISABLED                    #language en-US "Disabled"
#string STR_NULL                        #language en-US ""
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**         5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************